Version2/TestTool-Guinness/TestTool.Setup/Requests/Device Management/SetNTP/TC.DM.NVT.11_REQ_05.xml

<?xml version='1.0' encoding='utf-8'?>
<s:Envelope
 xmlns:s="http://www.w3.org/2003/05/soap-envelope"
 xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <tds:SetNTP>
      <tds:FromDHCP>false</tds:FromDHCP>
      <tds:NTPManual>
        <tt:Type>DNS</tt:Type>
        <tt:DNSname>NTP_NAME</tt:DNSname>
      </tds:NTPManual>
    </tds:SetNTP>
  </s:Body>
</s:Envelope>